app/Http/Controllers/Backend/Products/ProductsController.php

select * from `brands` where `brands`.`deleted_at` is null order by `created_at` desc
select * from `products` where `shop_id` = 1 and `products`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `shop_id` = 1 and `products`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $searchKey = null;
        $brand_id = null;
        $is_published = null;

        $products = Product::shop()->latest();
        if ($request->search != null) {
            $products = $products->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        if ($request->brand_id != null) {
            $products = $products->where('brand_id', $request->brand_id);
            $brand_id    = $request->brand_id;
        }

        if ($request->is_published != null) {
            $products = $products->where('is_published', $request->is_published);
            $is_published    = $request->is_published;
        }

        $brands = Brand::latest()->get();
        $products = $products->paginate(paginationNumber());

select `themes`.*, `product_themes`.`product_id` as `pivot_product_id`, `product_themes`.`theme_id` as `pivot_theme_id` from `themes` inner join `product_themes` on `themes`.`id` = `product_themes`.`theme_id` where `product_themes`.`product_id` in (10, 11, 12)
---
    public function create()
    {

        if (request()->ajax()) {
            $theme = CategoryTheme::whereIn('theme_id', (array)request()->ids)->pluck('category_id')->toArray();

            return view('backend.pages.products.products.category')->with(['categories' => Category::find($theme)]);

select * from `products` where `products`.`id` = '10' and `products`.`deleted_at` is null limit 1
select `category_id` from `category_themes` where `theme_id` in ('1')
select * from `categories` where `categories`.`id` in (10, 11) and `categories`.`deleted_at` is null
select `themes`.*, `category_themes`.`category_id` as `pivot_category_id`, `category_themes`.`theme_id` as `pivot_theme_id` from `themes` inner join `category_themes` on `themes`.`id` = `category_themes`.`theme_id` where `category_themes`.`category_id` in (10)
select * from `locations` where `is_default` = 1 and `locations`.`deleted_at` is null limit 1
select * from `languages` where `is_active` = 1 and `code` = 'en' limit 1
select * from `categories` where `parent_id` = 0 and `categories`.`deleted_at` is null order by `sorting_order_level` desc
select * from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null
select * from `units` where `is_active` = 1 and `units`.`deleted_at` is null
select * from `variations` where `is_active` = 1 and `id` not in (1, 2) and `variations`.`deleted_at` is null
select * from `taxes` where `is_active` = 1 and `taxes`.`deleted_at` is null
select * from `tags` where `tags`.`deleted_at` is null
---
    public function edit(Request $request, $id)
    {

        $product = Product::findOrFail($id);

        if (request()->ajax()) {

            $theme = CategoryTheme::whereIn('theme_id', (array)$request->ids)->pluck('category_id')->toArray();

            return view('backend.pages.products.products.category')->with(['categories' => Category::find($theme), 'product' => $product]);
        }


        $location = Location::where('is_default', 1)->first();
        $request->session()->put('stock_location_id',  $location->id);

        $lang_key = $request->lang_key;
        $language = Language::where('is_active', 1)->where('code', $lang_key)->first();
        if (!$language) {
            flash(localize('Language you are trying to translate is not available or not active'))->error();
            return redirect()->route('admin.products.index');
        }

        $categories = Category::where('parent_id')
            ->orderBy('sorting_order_level', 'desc')
            ->with('childrenCategories')
            ->get();
        $brands = Brand::isActive()->get();
        $units = Unit::isActive()->get();
        $variations = Variation::isActive()->whereNotIn('id', [1, 2])->get();
        $taxes = Tax::isActive()->get();
        $tags = Tag::all();

select * from `products` where `id` = '10' and `products`.`deleted_at` is null limit 1
---
    public function update(Request $request)
    {
        try {

            DB::transaction(function () use ($request) {

                if ($request->has('is_variant') && !$request->has('variations')) {
                    flash(localize('Invalid product variations, please check again'))->error();
                    return redirect()->back();
                }

                $product                    = Product::where('id', $request->id)->first();

update `products` set `sell_target` = '90000', `meta_title` = 'Broodis Kemeja Formal Pria Polos Grey Cotton Oxford Slimfit Lengan Pendek', `meta_description` = 'Merek: BROODIS\r\nGaris Leher: Collar \r\nBahan: Katun Motif: Polos \r\nPanjang Lengan: Lengan Pendek \r\nAcara: Kasual Stok: 27 \r\nDikirim Dari: KOTA TANGERANG SELATAN', `meta_img` = '51', `products`.`updated_at` = '2024-05-18 08:25:38' where `id` = 10
---
                    $product->meta_img = $request->meta_image;


                    $product->save();

select * from `locations` where `is_default` = 1 and `locations`.`deleted_at` is null limit 1
---
                    $product->product_taxes()->sync($taxes);


                    $location = Location::where('is_default', 1)->first();

select * from `product_variation_stocks` where `product_variation_stocks`.`product_variation_id` = 10 and `product_variation_stocks`.`product_variation_id` is not null and `location_id` = 1 limit 1
---


                        if ($variation->product_variation_stock) {
                            $productVariationStock = $variation->product_variation_stock_without_location()->where('location_id', $location->id)->first();

select * from `product_localizations` where (`lang_key` = 'en' and `product_id` = 10) limit 1
---
                    }
                }
                # Product Localization
                $ProductLocalization = ProductLocalization::firstOrNew(['lang_key' => $request->lang_key, 'product_id' => $product->id]);