app/Http/Controllers/Backend/Logistics/LogisticZonesController.php

    public function index(Request $request)
    {
        $searchKey = null;
        $searchLogistic = null;
        $logisticZones = LogisticZone::latest();
        if ($request->search != null) {
            $logisticZones = $logisticZones->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        if ($request->searchLogistic) {
            $logisticZones->where('logistic_id', $request->searchLogistic);
            $searchLogistic = $request->searchLogistic;
        }
        $logisticZones = $logisticZones->paginate(paginationNumber());
---
select * from `logistic_zones` where `logistic_zones`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `logistic_zones` where `logistic_zones`.`deleted_at` is null

    public function create()
    {
        $logistics = Logistic::where('is_active', 1)->latest()->get();
---
select * from `logistics` where `is_active` = 1 and `logistics`.`deleted_at` is null order by `created_at` desc

    public function getLogisticCities(Request $request)
    {
        $logistic = Logistic::find($request->logistic_id);
        $html = '<option value="">' . localize("Select City") . '</option>';

        if (!is_null($logistic)) {
            $logisticCities = $logistic->cities()->pluck('city_id');
            $cities =    City::isActive()->whereNotIn('id', $logisticCities)->latest()->get();
---
select * from `logistics` where `logistics`.`id` = '1' and `logistics`.`deleted_at` is null limit 1
select * from `cities` where `is_active` = 1 and 1 = 1 order by `created_at` desc

    public function store(Request $request)
    {
        $logisticZone = new LogisticZone;
        $logisticZone->name = $request->name;
        $logisticZone->logistic_id = $request->logistic_id;
        $logisticZone->standard_delivery_charge = priceToUsd($request->standard_delivery_charge);
        $logisticZone->standard_delivery_time = $request->standard_delivery_time;
        $logisticZone->save();

        foreach ($request->city_ids as $city_id) {
            LogisticZoneCity::where('logistic_id', $logisticZone->logistic_id)
                ->where('city_id', $city_id)
                ->delete();
            $logisticZoneCity                   = new LogisticZoneCity;
            $logisticZoneCity->logistic_id      = $logisticZone->logistic_id;
            $logisticZoneCity->logistic_zone_id = $logisticZone->id;
            $logisticZoneCity->city_id          = $city_id;
            $logisticZoneCity->save();
---
insert into `logistic_zones` (`name`, `logistic_id`, `standard_delivery_charge`, `standard_delivery_time`, `updated_at`, `created_at`) values ('Tangerang City - JNE', '1', '38000', '1 - 3 days', '2024-05-19 05:55:55', '2024-05-19 05:55:55')
delete from `logistic_zone_cities` where `logistic_id` = '1' and `city_id` = '502'
insert into `logistic_zone_cities` (`logistic_id`, `logistic_zone_id`, `city_id`, `updated_at`, `created_at`) values ('1', 1, '502', '2024-05-19 05:55:56', '2024-05-19 05:55:56')

    public function edit(Request $request, $id)
    {
        $logisticZone = LogisticZone::findOrFail($id);
        $cities       = City::isActive()->latest()->get();
---
select * from `logistic_zones` where `logistic_zones`.`id` = '1' and `logistic_zones`.`deleted_at` is null limit 1
select * from `cities` where `is_active` = 1 order by `created_at` desc