app/Http/Controllers/Backend/Logistics/LogisticsController.php

select * from `logistics` where `logistics`.`deleted_at` is null order by `created_at` asc limit 15 offset 0
select count(*) as aggregate from `logistics` where `logistics`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $searchKey = null;
        $logistics = Logistic::oldest();
        if ($request->search != null) {
            $logistics = $logistics->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        $logistics = $logistics->paginate(paginationNumber());

insert into `logistics` (`name`, `thumbnail_image`, `slug`, `updated_at`, `created_at`) values ('JNE', '7', 'jne-RTaQw', '2024-05-18 09:17:46', '2024-05-18 09:17:46')
---
    public function store(Request $request)
    {
        $logistic = new Logistic;
        $logistic->name = $request->name;
        $logistic->thumbnail_image = $request->image;

        if ($request->slug != null) {
            $logistic->slug = Str::slug($request->slug);
        } else {
            $logistic->slug = Str::slug($request->name) . '-' . Str::random(5);
        }

        $logistic->save();

select * from `logistics` where `logistics`.`id` = '1' and `logistics`.`deleted_at` is null limit 1
---
    public function edit(Request $request, $id)
    {
        $logistic = Logistic::findOrFail($id);

select * from `logistics` where `logistics`.`id` = '5' and `logistics`.`deleted_at` is null limit 1
---
    public function update(Request $request)
    {
        $logistic = Logistic::findOrFail($request->id);

select * from `logistics` where `logistics`.`id` = '1' and `logistics`.`deleted_at` is null limit 1
---
    public function updateStatus(Request $request)
    {
        $logistic = Logistic::findOrFail($request->id);

update `logistics` set `deleted_at` = '2024-05-18 09:59:33', `logistics`.`updated_at` = '2024-05-18 09:59:33' where `id` = 2
---
    public function delete($id)
    {
        $logistic = Logistic::findOrFail($id);
        LogisticZone::where('logistic_id', $logistic->id)->delete();